// search index for WYSIWYG Web Builder
var database_length = 0;

function SearchPage(url, title, keywords, description)
{
   this.url = url;
   this.title = title;
   this.keywords = keywords;
   this.description = description;
   return this;
}

function SearchDatabase()
{
   database_length = 0;
   this[database_length++] = new SearchPage("index.html", "Мистецтво. 5 клас. Інтегрований курс", " ІНТЕРАКТИВНИЙ ЕЛЕКТРОННИЙ ДОДАТОК   Запрошуємо в чарівний світ мистецтва!  Цей е-додаток допоможе вам навчатися легко, цікаво та ефективно Що на вас чекає  Інфографіка уроку  все й одразу Медіатека  дивіться відеоуроки, слухайте музичні твори, переглядайте майстер-класи, твори мистецтва, відвідайте віртуальні виставки та музеї Інтерактивні вправи  закріплюйте знання через ігри Мистецтво навколо нас! Творіть!    © 2026 ТОВ \"Генеза\"   ", "");
   this[database_length++] = new SearchPage("p1.html", "Мистецтво. 5 клас. Інтегрований курс", "ДОДАТОК 1  ВСТУП  РОЗДІЛ І НАРОДНЕ І ПРОФЕСІЙНЕ МИСТЕЦТВО   ", "");
   this[database_length++] = new SearchPage("p2.html", "Мистецтво. 5 клас. Інтегрований курс", "МИСТЕЦТВО НАВКОЛО  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("p3.html", "Мистецтво. 5 клас. Інтегрований курс", "НАРОДЖЕННЯ МИСТЕЦТВА  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("pro.html", "Мистецтво. 5 клас. Інтегрований курс", "                                                           Про інтерактивний електронний додаток  Цей е-додаток створено для того, щоб урізноманітнити навчання за підручником, зробити його ефективнішим і цікавішим Контент подано за темами відповідно до змісту підручника   Тут ви можете  ознайомитися з текстом підручника  стисло зрозуміти матеріал теми за допомогою інфографіки  переглянути навчальні та цікаві відео, зображення творів мистецтва, послухати музичні твори, знайти посилання на віртуальні тури визначними місцями та онлайн-ресурси для малювання  перевірити свої знання за допомогою інтерактивних вправ  Системні вимоги Операційна система — Windows 7 чи пізніші версії, Linux, ChromeOS, macOS, Android, iOS Оперативна пам’ять — 4 ГБ і більше Web browser — усі, що підтримують HTML5 Місце на жорсткому диску  для роботи офлайн  — 2 ГБ і більше  Uicons Flaticon   ", "");
   this[database_length++] = new SearchPage("p2p2.html", "Мистецтво. 5 клас. Інтегрований курс", "Оксана Шапкаріна Вишневий компот  Віктор Зарецький Витоки мистецтва   ", "");
   this[database_length++] = new SearchPage("p2p3.html", "Мистецтво. 5 клас. Інтегрований курс", " ", "");
   this[database_length++] = new SearchPage("p3p3.html", "Мистецтво. 5 клас. Інтегрований курс", "Наскельний живопис Франція Печера Ласко  Прадавня скульптура мамонта  Прадавня скульптура бізона   ", "");
   this[database_length++] = new SearchPage("p3p4.html", "Мистецтво. 5 клас. Інтегрований курс", " ", "");
   this[database_length++] = new SearchPage("p4.html", "Мистецтво. 5 клас. Інтегрований курс", "ВІД НАРОДНИХ ДЖЕРЕЛ  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("p4p4.html", "Мистецтво. 5 клас. Інтегрований курс", "Олена Скицюк «Вечірня тиша»  Марія Приймаченко Лежень ліг під яблуню  Михайло Білас Вертеп  Михайло Білас Гаївки  Марфа Тимченко Засвіт встали козаченьки   ", "");
   this[database_length++] = new SearchPage("p4p5.html", "Мистецтво. 5 клас. Інтегрований курс", "Музичне мистецтво Урок 1  Музичне мистецтво Урок 2   ", "");
   this[database_length++] = new SearchPage("p4p6.html", "Мистецтво. 5 клас. Інтегрований курс", "Образотворче мистецтво Урок 1  Образотворче мистецтво Урок 2   ", "");
   this[database_length++] = new SearchPage("p5.html", "Мистецтво. 5 клас. Інтегрований курс", "МИСТЕЦТВО І СПІЛКУВАННЯ  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("p5p5.html", "Мистецтво. 5 клас. Інтегрований курс", "Катя Дудник Таре Туаре  Лінійне мистецтво Анджели Хардинг  Джим Дейлі Суперечка  Морган Деніс Це мудра дитина  Джим Дейлі Турбота  Джим Дейлі Турбота   ", "");
   this[database_length++] = new SearchPage("p5p6.html", "Мистецтво. 5 клас. Інтегрований курс", "Музичне мистецтво Урок 1  Музичне мистецтво Урок 2   ", "");
   this[database_length++] = new SearchPage("p5p7.html", "Мистецтво. 5 клас. Інтегрований курс", "Образотворче мистецтво Урок 1  Образотворче мистецтво Урок 2   ", "");
   this[database_length++] = new SearchPage("p6.html", "Мистецтво. 5 клас. Інтегрований курс", "МИСТЕЦТВО І ДОВКІЛЛЯ  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("p6p6.html", "Мистецтво. 5 клас. Інтегрований курс", "Франс Снейдерс Пташиний концерт  Франс Галс Два хлопчики співають  Альберт Розенбум Урок співу  Франтишек Чаннер Планета Земля   ", "");
   this[database_length++] = new SearchPage("p6p7.html", "Мистецтво. 5 клас. Інтегрований курс", "Музичне мистецтво Урок 1  Музичне мистецтво Урок 2   ", "");
   this[database_length++] = new SearchPage("p6p8.html", "Мистецтво. 5 клас. Інтегрований курс", "Образотворче мистецтво Урок 1  Образотворче мистецтво Урок 2   ", "");
   this[database_length++] = new SearchPage("p7.html", "Мистецтво. 5 клас. Інтегрований курс", "РІЗНОБАРВ’Я БАГАТОГОЛОССЯ В МИСТЕЦТВІ  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("p7p1.html", "Мистецтво. 5 клас. Інтегрований курс", "Ольга Кваша Ніч  Майкл Розенвейн Джаз пізньої ночі  Цанко Лавренов Нічна музика  Ольга Кваша М’які обійми вечора  Рейчел Суггс Ілюстрація  Йосип Бокшай Осінь  Леонард Кемпбелл Тейлор Урок гри на скрипці  Едвін Олаф Хлопчик грає на флейті   ", "");
   this[database_length++] = new SearchPage("p7p2.html", "Мистецтво. 5 клас. Інтегрований курс", "Музичне мистецтво Урок 1  Музичне мистецтво Урок 2   ", "");
   this[database_length++] = new SearchPage("p7p3.html", "Мистецтво. 5 клас. Інтегрований курс", "Образотворче мистецтво Урок 1  Образотворче мистецтво Урок 2   ", "");
   this[database_length++] = new SearchPage("p8.html", "Мистецтво. 5 клас. Інтегрований курс", "ПОЧУТИ І ПОБАЧИТИ МИСТЕЦТВО  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("p8p1.html", "Мистецтво. 5 клас. Інтегрований курс", "Анрі Матісс Натюрморт з апельсинами  Вінсент ван Гог Іриси  Анрі Матісс Червоні рибки  Вінсент ван Гог Соняшники   ", "");
   this[database_length++] = new SearchPage("p8p2.html", "Мистецтво. 5 клас. Інтегрований курс", "Музичне мистецтво Урок 1  Музичне мистецтво Урок 2   ", "");
   this[database_length++] = new SearchPage("p8p3.html", "Мистецтво. 5 клас. Інтегрований курс", "Образотворче мистецтво Урок 1   ", "");
   this[database_length++] = new SearchPage("p9.html", "Мистецтво. 5 клас. Інтегрований курс", "СЕРЕДОВИЩЕ, НАПОВНЕНЕ МИСТЕЦТВОМ  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("p9p1.html", "Мистецтво. 5 клас. Інтегрований курс", "Гаррієт Мід Вівці  Ольга Рапай Принцеса і свинопас  фрагмент панно   Робін Уайт Фея з дроту  Дерево, що говорить  парк «Ефтелінг»   Джеф Нишінака  Скульптура з паперу  Скульптура в Сафарі-парк Chimelong  Китай   Мішель Мішо  Октет на репетиції  Пабло Пікассо  «Скрипка та гітара»  Скульптура в  Бенсон-парк  США   Джо Йонг Хо Лев  Джеймс Доран-Вебб Коні   ", "");
   this[database_length++] = new SearchPage("p9p2.html", "Мистецтво. 5 клас. Інтегрований курс", "Музичне мистецтво Урок 1  Музичне мистецтво Урок 2   ", "");
   this[database_length++] = new SearchPage("p9p3.html", "Мистецтво. 5 клас. Інтегрований курс", "Образотворче мистецтво Урок 1  Образотворче мистецтво Урок 2   ", "");
   return this;
}
